In [3]:
import pandas as pd
from pandas import Series,DataFrame

###series 的创建
###series 是定长的， 存在两个属性：index 和values, index 默认是0,1,2......，递增的整数序列
###Series 传入的是数组
x1= Series([1,2,3,4])
x2= Series(data=[1,2,3,4], index=['a','b','c','d'])

In [2]:
x1

0    1
1    2
2    3
3    4
dtype: int64

In [3]:
###采用字典的方式创建Series, 比如
d={'a':1,'b':2,'c':3,'d':4}
x3=Series(d)
x3

a    1
b    2
c    3
d    4
dtype: int64

In [5]:
###DataFrame 类型数据结构类似数据库表

##### DataFrame 和Series 的关系，可以将DataFrame 看成是由相同索引的Series
data = {'Chinese': [66, 95, 93, 90,80],'English': [65, 85, 92, 88, 90],'Math': [30, 98, 96, 77, 90]}
df2 = DataFrame(data, index=['ZhangFei', 'GuanYu', 'ZhaoYun', 'HuangZhong', 'DianWei'], columns=['English', 'Math', 'Chinese'])
print(df2)

            English  Math  Chinese
ZhangFei         65    30       66
GuanYu           85    98       95
ZhaoYun          92    96       93
HuangZhong       88    77       90
DianWei          90    90       80

In [ ]:
#数据清洗

In [ ]:
## 1. 删除DataFrame 中不必要的列或者行
### 1.1 删除列 colums=['Chinese']
df2 =df2.drop(columns=['Chinese'])
df2

            English  Math
ZhangFei         65    30
GuanYu           85    98
ZhaoYun          92    96
HuangZhong       88    77
DianWei          90    90

In [7]:
###1.2 删除行
df2=df2.drop(index=['ZhangFei'])
df2

            English  Math
GuanYu           85    98
ZhaoYun          92    96
HuangZhong       88    77
DianWei          90    90

In [9]:
## 2. 重命名列名 columns, 让列表名更容易识别
df2.rename(columns={'English':'Yingyu'}, inplace=True)

In [ ]:
###去除重复的值
df =df.drop_duplicates() ##去除重复行

In [ ]:
## 4. 格式问题
#### 4.1 更改数据格式
df2['Chinese'].astype('str')
df2['Chinese'].astype(np.int64)

In [ ]:
#### 4.2 删除数据间的空格
df2['Chinese']=df2['Chinese'].map(str.strip)  ##删除左右两边的空格
##删除左边的空格
df2['Chinese']=df2['Chinese'].map(str.lstrip)
##删除右边空格
df2['Chinese']=df2['Chinese'].map(str.rstrip)

In [16]:
###查找空值
##### DataFrame 和Series 的关系，可以将DataFrame 看成是由相同索引的Series
data = {'Chinese': [66, 95, 93, 90,20],'English': [65, 85, 92, 88, 90],'Math': [30, 98, 96, 77, 90]}
df2 = DataFrame(data, index=['ZhangFei', 'GuanYu', 'ZhaoYun', 'HuangZhong', 'DianWei'], columns=['English', 'Math', 'Chinese'])
print(df2)

            English  Math  Chinese
ZhangFei         65    30       66
GuanYu           85    98       95
ZhaoYun          92    96       93
HuangZhong       88    77       90
DianWei          90    90       20

In [17]:
###
df2.isnull() ###查看哪些地方存在空值NaN, 
df2.isnull().any() ###查看哪些列存在空值

English    False
Math       False
Chinese    False
dtype: bool

In [18]:
###使用apply 函数对数据进行清洗， apply 是Pandas 中自由度非常高的函数，使用频率也很高

In [21]:
### 自定义复杂的函数，应用到apply 上
def plus(df,n,m):
    df['new1']=(df['English']+df['Chinese']) * m
    df['new2']=(df['English']+df['Chinese']) * n
    return df
df2 = df2.apply(plus,axis=1,args=(2,3))  ##加上axis =1 表示应用到列上
df2

            English  Math  Chinese  new1  new2
ZhangFei         65    30       66   393   262
GuanYu           85    98       95   540   360
ZhaoYun          92    96       93   555   370
HuangZhong       88    77       90   534   356
DianWei          90    90       20   330   220

### 数据统计
#### describe 快速显示出 count, mean, std, min, 等等
####  数据表合并

In [26]:
df1 = DataFrame({'name':['ZhangFei', 'GuanYu', 'a', 'b', 'c'], 'data1':range(5)})
df2 = DataFrame({'name':['ZhangFei', 'GuanYu', 'A', 'B', 'C'], 'data2':range(5)})
df1

   data1      name
0      0  ZhangFei
1      1    GuanYu
2      2         a
3      3         b
4      4         c

In [27]:
df2

   data2      name
0      0  ZhangFei
1      1    GuanYu
2      2         A
3      3         B
4      4         C

#### 1. 基于指定列进行连接

In [25]:
df3 = pd.merge(df1,df2,on='name')
df3

   data1      name  data2
0      0  ZhangFei      0
1      1    GuanYu      1

#### 2. inner内连接, inner 是merge 合并的默认情况，inner 内链接其实就是键的
#### 交集， df1和df2 中相同的键是name, 所以是基于name字段做的连接

In [28]:
df3= pd.merge(df1,df2,how='inner')

In [29]:
df3

   data1      name  data2
0      0  ZhangFei      0
1      1    GuanYu      1

####  3. left 左连接，左连接是以第一个DataFrame为主进行的连接，第二个
#### DataFrame 作为补充

In [31]:
df3 = pd.merge(df1,df2, how='left')
df3

   data1      name  data2
0      0  ZhangFei    0.0
1      1    GuanYu    1.0
2      2         a    NaN
3      3         b    NaN
4      4         c    NaN

#### 4. right 右连接， 右连接时以第二个DataFrame 为主进行的连接，
#### 第一个DataFrame 作为补充

In [34]:
df3 = pd.merge(df1,df2, how='right')
df3

   data1      name  data2
0    0.0  ZhangFei      0
1    1.0    GuanYu      1
2    NaN         A      2
3    NaN         B      3
4    NaN         C      4

#### 5. outer 外连接

In [35]:
#### 外连接相当于求两个DataFrame 的并集
df3 = pd.merge(df1, df2, how='outer')
df3

   data1      name  data2
0    0.0  ZhangFei    0.0
1    1.0    GuanYu    1.0
2    2.0         a    NaN
3    3.0         b    NaN
4    4.0         c    NaN
5    NaN         A    2.0
6    NaN         B    3.0
7    NaN         C    4.0

#### 练习

In [44]:
data = {"语文": [66, 95, 95, 90, 80, 80],
            "英语": [65, 85, 92, 88, 90, 90],
            "数学": [None, 98, 96, 77, 90, 90]}
    
df = pd.DataFrame(data, columns=["语文", "英语", "数学"],index=["张飞", "关羽", "赵云", "黄忠", "典韦", "典韦"])
df

    语文  英语    数学
张飞  66  65   NaN
关羽  95  85  98.0
赵云  95  92  96.0
黄忠  90  88  77.0
典韦  80  90  90.0
典韦  80  90  90.0

In [45]:
###删除重复行
df=df.drop_duplicates()    
df

    语文  英语    数学
张飞  66  65   NaN
关羽  95  85  98.0
赵云  95  92  96.0
黄忠  90  88  77.0
典韦  80  90  90.0

In [46]:
### 用平均值填充
df['数学'].fillna(df['数学'].mean(),inplace=True)
df

D:\Users\NJLT004\Anaconda3\lib\site-packages\pandas\core\generic.py:4355: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._update_inplace(new_data)

    语文  英语     数学
张飞  66  65  90.25
关羽  95  85  98.00
赵云  95  92  96.00
黄忠  90  88  77.00
典韦  80  90  90.00

In [47]:
#### 增加一列total
df['total'] = df.sum(axis=1)
df

D:\Users\NJLT004\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

    语文  英语     数学   total
张飞  66  65  90.25  221.25
关羽  95  85  98.00  278.00
赵云  95  92  96.00  283.00
黄忠  90  88  77.00  255.00
典韦  80  90  90.00  260.00

In [52]:
###总分排序输出
df.sort_values(['total'],axis=0,ascending=False,inplace=True)
df

D:\Users\NJLT004\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

    语文  英语     数学   total
赵云  95  92  96.00  283.00
关羽  95  85  98.00  278.00
典韦  80  90  90.00  260.00
黄忠  90  88  77.00  255.00
张飞  66  65  90.25  221.25